STMicroelectronics-CentralLabs/ST_Drone_FCU_F401/STM32 FW Project/Official latest release 221117/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "debug.h"
#include "config_drone.h"
#include "timer.h"
#include "rc.h"
#include "steval_fcu001_v1.h"
#include "steval_fcu001_v1_accelero.h"
#include "steval_fcu001_v1_gyro.h"
#include "steval_fcu001_v1_magneto.h"
#include "steval_fcu001_v1_pressure.h"
#include "sensor_data.h"
#include "quaternion.h"
#include "ahrs.h"
#include "flight_control.h"
#include "motor.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim9;

UART_HandleTypeDef huart1;

static void *LSM6DSL_X_0_handle = NULL;
static void *LSM6DSL_G_0_handle = NULL;
static void *LIS2MDL_M_0_handle = NULL;
static void *LPS22HB_P_0_handle = NULL;
//static void *LPS22HB_T_0_handle = NULL;       /* To be used in case Temperature reading is needed */

extern Queue_TypeDef que;
extern volatile tUserTimer tim;
extern char rc_connection_flag;
extern int16_t gAIL, gELE, gTHR, gRUD;
int32_t rc_cal_flag = 0;
int32_t rc_enable_motor = 0;
int32_t rc_cal_cnt = 0;
int32_t fly_ready = 0;
unsigned char ch, ch_flag;

uint32_t tim9_event_flag = 0, tim9_cnt = 0, tim9_cnt2 = 0;
float tmp_euler_z = 0;


/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM9_Init(void);
static void MX_USART1_UART_Init(void);

static void initializeAllSensors( void );
void enableAllSensors( void );


/* USER CODE BEGIN 0 */
P_PI_PIDControlTypeDef pid;
EulerAngleTypeDef euler_rc, euler_ahrs, euler_rc_fil, euler_rc_y_pre[4], euler_rc_x_pre[4];
AxesRaw_TypeDef acc, gyro, mag, acc_fil_int, gyro_fil_int, mag_fil_int;
AxesRaw_TypeDef_Float acc_fil, acc_y_pre[4], acc_x_pre[4], acc_ahrs_FIFO[FIFO_Order], acc_FIFO[FIFO_Order], acc_ahrs;
AxesRaw_TypeDef_Float gyro_fil, gyro_y_pre[4], gyro_x_pre[4], gyro_ahrs_FIFO[FIFO_Order], gyro_FIFO[FIFO_Order], gyro_ahrs;
AxesRaw_TypeDef_Float mag_fil;
AxesRaw_TypeDef acc_off_calc, gyro_off_calc, acc_offset, gyro_offset;
EulerAngleTypeDef euler_ahrs_offset;
int sensor_init_cali = 0, sensor_init_cali_count = 0;
int gyro_cali_count = 0;

typedef struct
{
  int16_t X_Degree;
  int16_t Y_Degree;
  int16_t Z_Degree;
}Attitude_Degree;

typedef struct
{
  float a1, a2, b0, b1, b2;
}IIR_Coeff;

//sensor filter
//7hz, 800hz
//IIR_Coeff gyro_fil_coeff = {1.922286512869545,  -0.92519529534950118, 0.00072719561998898304, 0.0014543912399779661, 0.00072719561998898304};

//15hz, 800hz
//IIR_Coeff gyro_fil_coeff = {1.8337326589246479,  -0.84653197479202391, 0.003199828966843966, 0.0063996579336879321, 0.003199828966843966};

//30hz, 800hz
//IIR_Coeff gyro_fil_coeff = {1.66920314293119312,  -0.71663387350415764, 0.011857682643241156, 0.023715365286482312, 0.011857682643241156};

//60hz, 800hz
//IIR_Coeff gyro_fil_coeff = {1.3489677452527946 ,  -0.51398189421967566, 0.041253537241720303, 0.082507074483440607, 0.041253537241720303};

//100hz, 800hz
IIR_Coeff gyro_fil_coeff = {0.94280904158206336,  -0.33333333333333343, 0.09763107293781749 , 0.19526214587563498 , 0.09763107293781749 };

Attitude_Degree  Fly, Fly_offset, Fly_origin;
Gyro_Rad gyro_rad, gyro_degree, gyro_cali_degree;
MotorControlTypeDef motor_pwm;
int count1 = 0, count2 = 0;
AHRS_State_TypeDef ahrs;
float pre;

uint32_t VBAT_Sense;
float VBAT = 0;

uint8_t tmp_lis2mdl;
SensorAxes_t tmp_mag;

/* USER CODE END 0 */


 int main(void)
{

  /* USER CODE BEGIN 1 */
  int16_t pid_interval, i;
  
  int mytimcnt = 0;
  acc_fil.AXIS_X = 0;
  acc_fil.AXIS_Y = 0;
  acc_fil.AXIS_Z = 0;
  mag_fil.AXIS_X = 0;
  mag_fil.AXIS_Y = 0;
  mag_fil.AXIS_Z = 0;
  gyro_fil.AXIS_X = 0;
  gyro_fil.AXIS_Y = 0;
  gyro_fil.AXIS_Z = 0;
  euler_rc_fil.thx = 0;
  euler_rc_fil.thy = 0;
  euler_rc_fil.thz = 0;
  acc_off_calc.AXIS_X = 0;
  acc_off_calc.AXIS_Y = 0;
  acc_off_calc.AXIS_Z = 0;
  gyro_off_calc.AXIS_X = 0;
  gyro_off_calc.AXIS_Y = 0;
  gyro_off_calc.AXIS_Z = 0;
  acc_offset.AXIS_X = 0;
  acc_offset.AXIS_Y = 0;
  acc_offset.AXIS_Z = 1000;
  gyro_offset.AXIS_X = 0;
  gyro_offset.AXIS_Y = 0;
  gyro_offset.AXIS_Z = 0;
  euler_rc.thz = euler_ahrs.thz;
  euler_ahrs_offset.thx = 0;
  euler_ahrs_offset.thy = 0;

  for(i=0;i<4;i++)
  {
    acc_y_pre[i].AXIS_X = 0;
    acc_y_pre[i].AXIS_Y = 0;
    acc_y_pre[i].AXIS_Z = 0;
    acc_x_pre[i].AXIS_X = 0;
    acc_x_pre[i].AXIS_Y = 0;
    acc_x_pre[i].AXIS_Z = 0;
    gyro_y_pre[i].AXIS_X = 0;
    gyro_y_pre[i].AXIS_Y = 0;
    gyro_y_pre[i].AXIS_Z = 0;
    gyro_x_pre[i].AXIS_X = 0;
    gyro_x_pre[i].AXIS_Y = 0;
    gyro_x_pre[i].AXIS_Z = 0;
    euler_rc_y_pre[i].thx = 0;
    euler_rc_y_pre[i].thy = 0;
    euler_rc_y_pre[i].thz = 0;
    euler_rc_x_pre[i].thx = 0;
    euler_rc_x_pre[i].thy = 0;
    euler_rc_x_pre[i].thz = 0;
  }

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();  
  MX_TIM2_Init();
  MX_TIM4_Init();
  MX_TIM9_Init();
  MX_USART1_UART_Init();
  //MX_USB_DEVICE_Init();
 
  /* USER CODE BEGIN 2 */

  PRINTF("STEVAL-FCU001V1 FW rev.1.0 - Sep 2017\n\n");
  
//  Initialize Onboard LED
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  BSP_LED_Off(LED1);
  BSP_LED_Off(LED2);
  BSP_LED_On(LED1);
  BSP_LED_On(LED2);
  
