STMicroelectronics-CentralLabs/ST_Drone_FCU_F401/STM32 FW Project/Official latest release 221117/Src/main.c
  /* Configure and disable all the Chip Select pins for sensors on SPI*/
  Sensor_IO_SPI_CS_Init_All();
  
  /* Initialize and Enable the available sensors on SPI*/
  initializeAllSensors();
  enableAllSensors();
  
  /* Initialize settings for 6-axis MEMS Accelerometer */
  /* ODR 6.6kHz */
  /* FS 4g */
  /* Analog Filter Bandwith @ 1500Hz */
  /* ODR/2 low pass filtered sent to composite filter */
  /* Low pass filter enabled @ ODR/400 */
  //BSP_ACCELERO_Set_ODR_Value(LSM6DSL_X_0_handle, 1660.0);       /* ODR 1.6kHz */
  BSP_ACCELERO_Set_ODR_Value(LSM6DSL_X_0_handle, 6660.0);       /* ODR 6.6kHz */
  BSP_ACCELERO_Set_FS(LSM6DSL_X_0_handle, FS_MID);                   /* FS 4g */
  //LSM6DSL_ACC_GYRO_W_InComposit(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_IN_ODR_DIV_4);   /* ODR/4 low pass filtered sent to composite filter */
  LSM6DSL_ACC_GYRO_W_InComposit(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_IN_ODR_DIV_2);   /* ODR/2 low pass filtered sent to composite filter */
  LSM6DSL_ACC_GYRO_W_LowPassFiltSel_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_LPF2_XL_ENABLE); /* Enable LPF2 filter in composite filter block */
  //LSM6DSL_ACC_GYRO_W_HPCF_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_HPCF_XL_DIV4); /* Low pass filter @ ODR/50 */
  //LSM6DSL_ACC_GYRO_W_HPCF_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_HPCF_XL_DIV100); /* Low pass filter @ ODR/100 */
  LSM6DSL_ACC_GYRO_W_HPCF_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_HPCF_XL_DIV400); /* Low pass filter @ ODR/400 */
  uint8_t tmp_6axis_reg_value;
  BSP_ACCELERO_Read_Reg(LSM6DSL_X_0_handle, 0x10, &tmp_6axis_reg_value);
  //tmp_6axis_reg_value = tmp_6axis_reg_value | 0x01;                             /* Set LSB to 1 >> Analog filter 400Hz*/
  tmp_6axis_reg_value = tmp_6axis_reg_value & 0xFE;                             /* Set LSB to 0 >> Analog filter 1500Hz*/
  BSP_ACCELERO_Write_Reg(LSM6DSL_X_0_handle, 0x10, tmp_6axis_reg_value);
  
  /* Initialize settings for 6-axis MEMS Gyroscope */
  /* FS 2000dps */
  /* ODR 416Hz */
  /* LPF1 FTYPE set to 10b */
  LSM6DSL_ACC_GYRO_W_LP_BW_G(LSM6DSL_G_0_handle, LSM6DSL_ACC_GYRO_LP_G_NARROW); /* LPF1 FTYPE set to 10b */                                                      
  BSP_GYRO_Write_Reg(LSM6DSL_G_0_handle, 0x11, 0x6C);                           /* Gyroscope settings: full scale 2000dps, ODR 416Hz */
  
  /* Initialize settings for Magnetometer settings (By default after reset is in in idle mode) */
  /* Register CFG_REG_A 0x60 = 0x8c */
  /* Register 0x61 = 0x02 */
  BSP_MAGNETO_Write_Reg(LIS2MDL_M_0_handle, 0x60, 0x8c);
  BSP_MAGNETO_Write_Reg(LIS2MDL_M_0_handle, 0x61, 0x02);
  
  /* Initialize Remote control*/
  init_remote_control();

  /* Initialize TIM2 for External Remocon RF receiver PWM Input*/
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_1);
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_2);
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_3);
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_4);

  /* Initialize TIM4 for Motors PWM Output*/
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_4);

  /* Initialize General purpose TIM9 50Hz*/
  HAL_TIM_Base_Start_IT(&htim9);

  /* Initialize PID and set Motor PWM to zero */
  PIDControlInit(&pid);
  set_motor_pwm_zero(&motor_pwm);

  /* Setup a timer with 5ms interval */
  pid_interval = PID_SAMPLING_TIME*1000;
  SetupTimer(&tim, pid_interval);

  /* Start timer */
  StartTimer(&tim);
  ch = 0;
  ch_flag = 0;
  
  /* USER CODE END 2 */

  
  
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

    if (tim9_event_flag == 1)
    {     // Timer9 event: frequency 50Hz
      tim9_event_flag = 0;

      count1++;
           
      acc_ahrs.AXIS_X = 0;
      acc_ahrs.AXIS_Y = 0;
      acc_ahrs.AXIS_Z = 0;
      gyro_ahrs.AXIS_X = 0;
      gyro_ahrs.AXIS_Y = 0;
      gyro_ahrs.AXIS_Z = 0;

      for(i=0;i<FIFO_Order;i++)
      {
        acc_ahrs.AXIS_X += acc_ahrs_FIFO[i].AXIS_X;
        acc_ahrs.AXIS_Y += acc_ahrs_FIFO[i].AXIS_Y;
        acc_ahrs.AXIS_Z += acc_ahrs_FIFO[i].AXIS_Z;
        gyro_ahrs.AXIS_X += gyro_ahrs_FIFO[i].AXIS_X;
        gyro_ahrs.AXIS_Y += gyro_ahrs_FIFO[i].AXIS_Y;
        gyro_ahrs.AXIS_Z += gyro_ahrs_FIFO[i].AXIS_Z;
      }

      acc_ahrs.AXIS_X *=FIFO_Order_Recip;
      acc_ahrs.AXIS_Y *=FIFO_Order_Recip;
      acc_ahrs.AXIS_Z *=FIFO_Order_Recip;
      gyro_ahrs.AXIS_X *=FIFO_Order_Recip;
      gyro_ahrs.AXIS_Y *=FIFO_Order_Recip;
      gyro_ahrs.AXIS_Z *=FIFO_Order_Recip;

      acc_fil_int.AXIS_X = acc_ahrs.AXIS_X;
      acc_fil_int.AXIS_Y = acc_ahrs.AXIS_Y;
      acc_fil_int.AXIS_Z = acc_ahrs.AXIS_Z;
      gyro_fil_int.AXIS_X = gyro_ahrs.AXIS_X;
      gyro_fil_int.AXIS_Y = gyro_ahrs.AXIS_Y;
      gyro_fil_int.AXIS_Z = gyro_ahrs.AXIS_Z;


      //PRINTF("%f %f %f %f\n", acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y);

      // AHRS update, quaternion & true gyro data are stored in ahrs
      ahrs_fusion_ag(&acc_ahrs, &gyro_ahrs, &ahrs);

      // Calculate euler angle drone
      QuaternionToEuler(&ahrs.q, &euler_ahrs);

      // Get target euler angle from remote control
      GetTargetEulerAngle(&euler_rc, &euler_ahrs);


      if(gTHR<MIN_THR)
      {
        euler_ahrs_offset.thx = 0;
        euler_ahrs_offset.thy = 0;
      }

      Fly_origin.X_Degree = (int16_t)(euler_ahrs.thx * 5730);
      Fly_origin.Y_Degree = (int16_t)(euler_ahrs.thy * 5730);
      Fly_origin.Z_Degree = (int16_t)(euler_ahrs.thz * 5730);


      if(gTHR<MIN_THR)
      {
        euler_rc.thz = 0;
        euler_ahrs.thz = 0;
      }

      euler_rc_fil.thx = euler_rc.thx;
      euler_rc_fil.thy = euler_rc.thy;
      euler_rc_fil.thz = euler_rc.thz;

      FlightControlPID_OuterLoop(&euler_rc_fil, &euler_ahrs, &ahrs, &pid);

    }

  if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
  {
    ch_flag = 1;
  }

  if (isTimerEventExist(&tim))    // Check if a timer event is present
  {

        ClearTimer(&tim);           // Clear current event;

        count2++;

        mytimcnt++;
        if (rc_connection_flag && rc_enable_motor)
        {
          if (mytimcnt%50 == 0)
          BSP_LED_On(LED2);
        }
        else
        {
          if (mytimcnt%50 == 0)
            BSP_LED_Toggle(LED2);
        }
    }
  
    /* Added for debug on UART*/
    /* Remocon ELE, AIL, RUD, THR, Motor1_pwm, AHRS Euler angle x and y axis */
    PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, motor_pwm.motor1_pwm, euler_ahrs.thx * 57.3, euler_ahrs.thy * 57.3, euler_rc.thx * 57.3, euler_rc.thy * 57.3);
    
