STMicroelectronics-CentralLabs/ST_Drone_FCU_F401/STM32 FW Project/Official latest release 221117/Src/main.c
      gyro_rad.gx = gyro_fil.AXIS_X*COE_MDPS_TO_RADPS;
      gyro_rad.gy = gyro_fil.AXIS_Y*COE_MDPS_TO_RADPS;
      gyro_rad.gz = gyro_fil.AXIS_Z*COE_MDPS_TO_RADPS;

      euler_ahrs.thz += gyro_rad.gz*PID_SAMPLING_TIME;

      if(gTHR<MIN_THR)
      {
        euler_rc.thz = 0;
        euler_ahrs.thz = 0;
      }


      if (rc_connection_flag && rc_enable_motor)
      {   // Do PID Control
        FlightControlPID_innerLoop(&euler_rc_fil, &gyro_rad, &ahrs, &pid, &motor_pwm);
      }
      else
      {
        // set motor output zero
        set_motor_pwm_zero(&motor_pwm);
      }

      if(gTHR<MIN_THR)
      {
        set_motor_pwm_zero(&motor_pwm);
      }

      set_motor_pwm(&motor_pwm);      /* To comment if want to debug remocon calibration switching off the motors */
  }
}


/**
* @brief  Initialize all sensors
* @param  None
* @retval None
*/
static void initializeAllSensors( void )
{
  if (BSP_ACCELERO_Init( LSM6DSL_X_0, &LSM6DSL_X_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }
  
  if (BSP_GYRO_Init( LSM6DSL_G_0, &LSM6DSL_G_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }
  
  if (BSP_MAGNETO_Init( LIS2MDL_M_0, &LIS2MDL_M_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }
  
  
  if (BSP_PRESSURE_Init( LPS22HB_P_0, &LPS22HB_P_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }

//  if (BSP_TEMPERATURE_Init( LPS22HB_T_0, &LPS22HB_T_0_handle ) != COMPONENT_OK)
//  {
//    while(1);
//  }
//  
  
}

/**
* @brief  Enable all sensors
* @param  None
* @retval None
*/
void enableAllSensors( void )
{
  BSP_ACCELERO_Sensor_Enable( LSM6DSL_X_0_handle );
  PRINTF("LSM6DSL MEMS Accelerometer initialized and enabled\n");
  BSP_GYRO_Sensor_Enable( LSM6DSL_G_0_handle );
  PRINTF("LSM6DSL MEMS Gyroscope initialized and enabled\n");
  BSP_MAGNETO_Sensor_Enable( LIS2MDL_M_0_handle );
  PRINTF("LIS2MDL Magnetometer initialized and enabled\n");
  BSP_PRESSURE_Sensor_Enable( LPS22HB_P_0_handle );
  PRINTF("LPS22HB Pressure sensor initialized and enabled\n");
//  BSP_TEMPERATURE_Sensor_Enable( LPS22HB_T_0_handle );
}



/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
